Autodesk.Revit.DB.StructuralBehavior
Specifies whether structural elements behave orthotropically, isotropically, or transverse-isotropically.
Since:
2012
Since:
2012

Autodesk.Revit.DB.StructuralBehavior.TransverseIsotropic
The structural element behaves transverse-isotropically.

Autodesk.Revit.DB.StructuralBehavior.Orthotropic
The structural element behaves orthotropically.

Autodesk.Revit.DB.StructuralBehavior.Isotropic
The structural element behaves isotropically.